#  Python Pandas practice

In [1]:
import pandas as pd

## In Pandas there are three data structures present 
### 1.) Series(one-D)
### 2.)DataFrame(two-D)
### 3.) Panel(three-D)
  

  Now we are studying aboout 1st datastructure which is Series

In [5]:
a={
    'a': 10,
    'b': 20,
    'c': 30,
    'd': 40
}
var=pd.Series(a, dtype="float")
print(var)

a    10.0
b    20.0
c    30.0
d    40.0
dtype: float64

In [3]:
print(type(var))

<class 'pandas.core.series.Series'>

In [6]:
x=[1,2,3,4,5]
var =pd.Series(x,index=['a','b','c','d','e'],dtype="float",name="python")
print(var)
print(type(var))
print(var[2:5])

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
Name: python, dtype: float64
<class 'pandas.core.series.Series'>
c    3.0
d    4.0
e    5.0
Name: python, dtype: float64

In [7]:
dic={"Name":['python','c++','java','c'],"por":[12,13,14,15],"rank":[1,2,3,4]}
var1=pd.Series(dic)
print(var1)

Name    [python, c++, java, c]
por           [12, 13, 14, 15]
rank              [1, 2, 3, 4]
dtype: object

## 2.) DataFrame

It is 2-D datastructure and we can also make a dataframe by the help of two series .

In [10]:
import pandas as pd 
a={"a":[1,2,3,4,5],"b":[6,7,8,9,10]}
var1=pd.DataFrame(a)
print(var1)
print(type(var1))

   a   b
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10
<class 'pandas.core.frame.DataFrame'>

In [11]:
print(var1["a"])

0    1
1    2
2    3
3    4
4    5
Name: a, dtype: int64

In [14]:
print(var1["b"][2])

8

## Making of DataFrame by the help of to series |

In [ ]:
sr={"s":pd.Series([1,2,3,4,5]),"r":pd.Series([6,7,8,9,10])}
var2=pd.DataFrame(sr)
print(sr)

{'s': 0    1
1    2
2    3
3    4
4    5
dtype: int64, 'r': 0     6
1     7
2     8
3     9
4    10
dtype: int64}

# Airthmetic operations

Additon,Substraction,Multiplication,Devision

In [18]:
f={"a":[1,2,3,4,5],"b":[3,4,5,6,7]
   }
var=pd.DataFrame(f)
print(var
      )

   a  b
0  1  3
1  2  4
2  3  5
3  4  6
4  5  7

In [19]:
var["c"]=var["a"]+var["b"]
var

   a  b   c
0  1  3   4
1  2  4   6
2  3  5   8
3  4  6  10
4  5  7  12

In [20]:
var["c"]=var["a"]-var["b"]
var

   a  b  c
0  1  3 -2
1  2  4 -2
2  3  5 -2
3  4  6 -2
4  5  7 -2

In [21]:
var["c"]=var["a"]*var["b"]
var

   a  b   c
0  1  3   3
1  2  4   8
2  3  5  15
3  4  6  24
4  5  7  35

In [22]:
var["c"]=var["a"]/var["b"]
var

   a  b         c
0  1  3  0.333333
1  2  4  0.500000
2  3  5  0.600000
3  4  6  0.666667
4  5  7  0.714286

In [24]:
var["c"]=var["b"]%var["a"]
var

   a  b  c
0  1  3  0
1  2  4  0
2  3  5  2
3  4  6  2
4  5  7  2

In [25]:
var1 =pd.DataFrame({"a":[10,20,30,40],"b":[40,50,60,70]})
print(var1)

    a   b
0  10  40
1  20  50
2  30  60
3  40  70

In [28]:
var1["python"]=var1["a"]<30
var1["python2"]=var1["b"]>=60
var1

    a   b  python  python2
0  10  40    True    False
1  20  50    True    False
2  30  60   False     True
3  40  70   False     True

for insert and delete 
for insert we use .insert method and for delete we use pop method or delete(del) keyword.

In [32]:
var1.insert(2, "add_new", var1["a"])
var1

    a   b  add_new  add  python  python2
0  10  40       10   50    True    False
1  20  50       20   70    True    False
2  30  60       30   90   False     True
3  40  70       40  110   False     True

for delete

In [33]:
var1.pop("add_new")
var1

    a   b  add  python  python2
0  10  40   50    True    False
1  20  50   70    True    False
2  30  60   90   False     True
3  40  70  110   False     True

In [36]:
del var1["add"]
var1

    a   b  python  python2
0  10  40    True    False
1  20  50    True    False
2  30  60   False     True
3  40  70   False     True

## csv file handling

In [37]:
import pandas as pd

In [40]:
dis= {
    'a': [10, 20, 30,40,50],
    'b': [5, 15, 25, 35,45],
    'c': [1, 2, 3, 4, 5]
}
d=pd.DataFrame(dis)
print(d)
d.to_csv("text2.csv",index=False,header=[1,2,3])

    a   b  c
0  10   5  1
1  20  15  2
2  30  25  3
3  40  35  4
4  50  45  5

## reading csv files or datasets

In [41]:
import pandas as pd 
csv_1=pd.read_csv("C:\\Users\\svish\\OneDrive\\Desktop\\titanic-dataset\\train.csv")
csv_1

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q